// （中国大陆）手机号：宽松版本，1 开头的 10 位
export const MOBILE_PHONE_REGEXP = /^\d{11}$/;

// 密码：最少 6 位，最多 16 位，包括至少1个大写字母，1个小写字母，1个数字，可以包含特殊字符 ~!@#$%^&*
export const PASSWORD_REGEXP = /^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])[a-zA-Z0-9~!@#$%^&*-]{6,16}$/;

// 用户名：
export const USERNAME_REGEXP = /^[a-zA-Z0-9#._-]{4,16}$/;

// 邮箱：
export const EMAIL_REGEXP = /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/;

// 验证码：
export const VCODE_REGEXP = /^[0-9]{6}$/;

// URL:
export const URL_REGEX = new RegExp(
  "^(?:http|https|ftp)://(?:[a-zA-Z0-9.-]+(?::[a-zA-Z0-9.&%$-]+)*@)*(?:(?:25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[1-9]).(?:25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[1-9]|0).(?:25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[1-9]|0).(?:25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[0-9])|localhost|(?:[a-zA-Z0-9-]+.)*[a-zA-Z0-9-]+.(com|edu|gov|int|mil|net|org|biz|arpa|info|name|pro|aero|coop|museum|[a-zA-Z]{2}))(?::[0-9]+)*(?:/(?:$|[a-zA-Z0-9.,?'\\+&%$#=~_-]+))*$",
  "gi"
);
